<template>
  <div id="terms">
    <div class="terms-wrapper">
        <h1>{{ companyShort }} {{ terms }}</h1>


        <h3>제1조 (목적)</h3>
        <p>
            본 약관은 회원({{ companyShort }} 서비스 약관에 동의한 사람)이 {{ companyKo }}(이하 '회사'라 합니다)가 제공하는 {{ companyShort }} 서비스(이하 '서비스'라 합니다)를 이용함에 있어 회사와 회원의 권리·의무 및 책임사항을 규정함을 목적으로 합니다
        </p>


        <h3>제2조 (용어의 정의)</h3>
        <p>
            본 약관에서 사용하는 용어의 정의는 다음과 같습니다.
        </p>
            <ol class="terms-list">
                <li>'서비스'란 접속 가능한 유·무선 단말기의 종류와는 상관없이 이용 가능한 회사가 제공하는 모든 서비스를 의미합니다.</li>
                <li>'이용자'란 회사 서비스에 접속하여, 이 약관에 따라 회사가 제공하는 서비스를 이용하는 회원과 비회원을 의미합니다.</li>
                <li>'회원'이란 회사와 서비스 이용 계약을 체결한 개인 또는 기업을 의미합니다.</li>
                <li>'계정'이란 서비스를 이용하기 위해 사용되는 '{{ companyShort }} 계정'이나 '소셜 로그인 계정'을 의미합니다.</li>
                <li>'{{ companyShort }} 계정'이란 회원이 서비스를 이용하기 위하여 필요한 휴대전화 번호 및 비밀번호 기반의 로그인 계정을 의미합니다.</li>
                <li>'소셜 로그인 계정'이란 소셜 로그인 플랫폼사(社) 및 소셜 로그인 연동사(社)를 통해 회원이 승인한 페이스북, 카카오 등의 계정 정보 기반의 로그인 계정을 의미합니다.</li>
                <li>'비밀번호'란 회원이 {{ companyShort }} 계정에 등록한 전화번호와 일치하는 회원임을 확인하고 회원의 비밀보호를 위해 회원 자신이 설정한 문자와 숫자의 조합을 의미합니다.</li>
                <li>'탈퇴'란 회사 또는 회원이 서비스 개통 후 이용계약을 해약하는 것을 의미합니다.</li>
            </ol>


        <h3>제3조 (약관의 효력 및 변경)</h3>
            <ol class="terms-list">
                <li>본 약관은 서비스를 이용하고자 하는 이용자가 본 약관에 동의하고 회사가 정한 소정의 절차에 따라 서비스의 회원으로 등록함으로써 효력이 발생합니다.</li>
                <li>회원이 전항의 절차에 따라 본 약관의 동의하였을 경우 본 약관의 내용을 모두 읽고 이를 충분히 이해하였으며, 그 적용에 동의한 것으로 봅니다.</li>
                <li>회사는 본 약관의 내용을 회원이 쉽게 알 수 있도록 서비스 초기 화면에 게시하거나 기타의 방법으로 공지합니다.</li>
                <li>회사는 필요하다고 인정되면 본 약관을 변경할 수 있으며, 회사가 약관을 개정할 경우에는 기존약관과 개정약관 및 개정약관의 적용일자와 개정사유를 명시하여 현행약관과 함께 그 적용일자 7일 전부터 적용일 이후 상당한 기간 동안 공지합니다. 다만, 개정 내용이 회원에게 불리한 경우에는 그 적용일자 30일 전부터 적용일 이후 상당한 기간 동안 각각 이를 서비스 홈페이지에 게시하거나 회원에게 전자적 형태(전자우편, SMS 등)로 약관 개정 사실을 발송하여 고지합니다.</li>
                <li>회사가 전항에 따라 회원에게 공지하거나 통지하면서 공지 또는 통지ㆍ고지일로부터 개정약관 시행일 7일 후까지 거부의사를 표시하지 아니하면 승인한 것으로 본다는 뜻을 명확하게 고지하였음에도 불구하고 거부의 의사표시가 없는 경우에는 변경된 약관에 승인한 것으로 봅니다. 회원이 개정약관에 동의하지 않을 경우 회원은 이용계약을 해지할 수 있습니다.</li>
            </ol>


        <h3>제4조 (계정)</h3>
        <p>
            이용자는 서비스를 이용하기 위해 ‘{{ companyShort }} 계정’이나 ‘소셜 로그인 계정’ 중 하나를 선택하여 이용해야 합니다.
            {{ companyShort }} 계정은 이용자가 약관에 동의하고 이용자의 전화번호를 입력하고 비밀번호를 등록하는 절차로 생성됩니다. 다만, 실제 휴대전화의 소유주임을 확인하기 위해서 가입 당시 인증 절차를 거치게 됩니다.
            소셜 로그인 계정은 해당 소셜 플랫폼에 {{ companyShort }}가 필요로 하는 정보에 대한 접근 권한을 이용자가 승인하는 절차로 생성됩니다. 다만, {{ companyShort }}의 정보 접근을 승인하기 위해서는 해당 소셜 플랫폼 계정의 로그인이 필요할 수 있습니다.
            모든 계정에는 상기 외에 닉네임 등의 부가적인 정보를 받을 수 있으며, 또한 거주지 기반의 커뮤니티 서비스를 제공하기 위한 주소 정보와 이를 인증하는 소정의 절차를 필요로 할 수 있습니다.
            아래의 경우에는 계정 생성을 승인하지 않을 수 있습니다.
        </p>
            <ol class="terms-list">
                <li>다른 사람의 명의나 휴대전화 번호 등 개인정보를 이용하여 계정을 생성하려 한 경우</li>
                <li>동일인이 다수의 계정을 생성하려 한 경우</li>
                <li>계정 생성시 필요한 정보를 입력하지 않거나 허위 정보를 입력한 경우</li>
                <li>{{ companyShort }}가 과거에 운영원칙 또는 법률 위반 등의 정당한 사유로 해당 계정을 삭제 또는 징계한 경우</li>
                <li>사기 정보 모음 사이트나 정부기관 사이트 등에서 거래 사기 이력이 있는 휴대전화 번호로 확인된 경우</li>
            </ol>
        <p>
            만약, 이용자가 위 조건에 위반하여 계정을 생성한 것으로 판명된 때에는 {{ companyShort }}는 즉시 이용자의 서비스 이용을 중단하거나 계정을 삭제하는 등 적절한 제한을 할 수 있습니다.
            계정은 회원 본인만 이용할 수 있으며, 다른 사람이 회원의 계정을 이용하도록 허락할 수 없습니다. 그리고 회원은 다른 사람이 회원의 계정을 무단으로 사용할 수 없도록 직접 비밀번호를 관리하여야 합니다. 만약 무단 사용이 발견된다면, 서비스 내 메뉴나 {{ companyShort }} 고객 센터를 통하여 알려주시기 바라며, {{ companyShort }}는 무단 사용을 막기 위한 방법을 이용자에게 안내하도록 하겠습니다.
            이용자는 서비스 내 설정 화면을 통하여 이용자의 정보를 열람하고 수정할 수 있습니다. 다만, 서비스의 제공 및 관리를 위해 필요한 계정, 전화번호, 단말기 식별번호 등 일부 정보는 수정이 불가능할 수 있습니다. 이용자가 {{ companyShort }} 서비스 이용 신청시 알려주신 내용에 변동이 있을 때, 직접 {{ companyShort }} 서비스에서 수정하거나 이메일, {{ companyShort }} 고객 센터를 통하여 {{ companyShort }}에 알려 주시기 바랍니다.
        </p>


        <h3>제5조 (부정이용)</h3>
        <p>
            {{ companyShort }}는 이용자가 아래와 같이 잘못된 방법이나 행위로 서비스를 이용할 경우 사용에 대한 제재(이용정지, 강제탈퇴 등)를 가할 수 있습니다.
        </p>
            <ol class="terms-list">
                <li>잘못된 방법으로 서비스의 제공을 방해하거나 {{ companyShort }}가 안내하는 방법 이외의 다른 방법을 사용하여 {{ companyShort }} 서비스에 접근하는 행위</li>
                <li>다른 이용자의 정보를 무단으로 수집, 이용하거나 다른 사람들에게 제공하는 행위</li>
                <li>서비스를 영리나 홍보 목적으로 이용하는 행위</li>
                <li>음란 정보나 저작권 침해 정보 등 공서양속 및 법령에 위반되는 내용의 정보 등을 발송하거나 게시하는 행위</li>
                <li>{{ companyShort }}의 동의 없이 {{ companyShort }} 서비스 또는 이에 포함된 소프트웨어의 일부를 복사, 수정, 배포, 판매, 양도, 대여, 담보제공하거나 타인에게 그 이용을 허락하는 행위</li>
                <li>소프트웨어를 역설계하거나 소스 코드의 추출을 시도하는 등 {{ companyShort }} 서비스를 복제, 분해 또는 모방하거나 기타 변형하는 행위</li>
                <li>관련 법령, {{ companyShort }}의 모든 약관 또는 정책을 준수하지 않는 행위</li>
            </ol>


        <h3>제6조 (개인정보 보호)</h3>
        <p>
            이용자의 개인정보의 안전한 처리는 {{ companyShort }}에게 있어 가장 중요한 일 중 하나입니다. 이용자의 개인정보는 {{ companyShort }} 서비스의 원활한 제공을 위하여 이용자가 동의한 목적과 범위 내에서만 이용됩니다. 법령에 의하거나 이용자가 별도로 동의하지 아니하는 한 {{ companyShort }}가 이용자의 개인정보를 제3자에게 제공하는 일은 없습니다. {{ companyShort }}가 이용자의 개인정보를 안전하게 처리하기 위하여 기울이는 노력이나 기타 상세한 사항은 ‘{{ companyShort }} 개인정보 처리방침’을 참고하여 주십시오.
        </p>


        <h3>제7조 (저작권 보호)</h3>
        <p>
            {{ companyShort }}는 이용자의 지적재산권을 존중합니다.
        </p>
            <ol class="terms-list">
                <li>{{ companyShort }} 서비스 이용자가 서비스 내에 게시한 사진, 글, 정보, {{ companyShort }}에 대한 의견이나 제안 등의 게시물의 저작권은 해당 게시물의 저작자에게 귀속됩니다.</li>
                <li>이용자가 서비스 내에 게시하는 게시물은 {{ companyShort }} 서비스, 검색결과, 관련 프로모션 및 광고 등에 노출될 수 있습니다. 이용자는 이에 필요한 범위 내에서 사용, 저장, 수정, 복제, 편집, 공중송신, 전시, 배포 등의 방식으로 이용할 수 있도록 사용을 허락하는 전 세계적인 라이선스를 제공하게 됩니다. 이 경우, {{ companyShort }}는 저작권법 규정을 준수하며, 이용자는 언제든지 고객센터 또는 운영자 문의 기능을 통해 해당 게시물에 대해 삭제, 검색결과 제외, 비공개 등의 조치를 요청할 수 있습니다.</li>
                <li>이용자가 {{ companyShort }}와 협력사에게 부여하는 권리는 {{ companyShort }} 서비스를 운영, 개선, 홍보하고 새로운 {{ companyShort }} 서비스를 개발하기 위한 범위 내에서 사용되며, 이 이외의 방법으로 이용자의 게시물을 이용하고자 하는 경우에는 전화, 팩스, 전자우편 등을 통해 사전에 이용자의 동의를 얻어야 합니다.</li>
            </ol>


        <h3>제8조 (콘텐츠 관리)</h3>
            <ol class="terms-list">
                <li>이용자의 게시물이 법령 및 {{ companyShort }} 서비스 정책에 위반된다고 판단할 경우 해당 게시물에 대해 임시조치(삭제, 노출제한, 게시중단) 등을 취할 수 있습니다.</li>
                <li>{{ companyShort }}가 모든 콘텐츠를 검토할 의무가 있는 것은 아니며, 누군가 이용자의 권리를 침해하였다면 서비스 내에서 제공되는 방법이나 {{ companyShort }} 고객센터를 통해 게시 중단요청에 대한 도움을 받으실 수 있습니다.</li>
                <li>{{ companyShort }} 서비스에서는 {{ companyShort }}가 보유하지 않은 일부 콘텐츠가 표시될 수 있습니다. 그러한 콘텐츠에 대해서는 콘텐츠를 제공한 주체가 단독으로 모든 책임을 부담하게 됩니다. 이용자가 {{ companyShort }} 서비스를 이용하더라도 다른 이용자의 콘텐츠에 대하여 어떠한 권리를 가지게 되는 것은 아닙니다. 이용자는 다른 이용자의 콘텐츠를 사용하기 위하여는 콘텐츠 소유자로부터 별도로 허락을 받아야 합니다.</li>
            </ol>


        <h3>제9조 (위치기반서비스)</h3>
        <p>
            {{ companyShort }}는 서비스의 주요한 기능 및 이용자의 실생활에 더욱 보탬이 되는 유용한 서비스를 제공하기 위하여 위치기반서비스를 포함시킬 수 있습니다.
            {{ companyShort }}의 위치기반서비스는 사용지의 단말기기의 위치정보를 수집하는 위치정보사업자로부터 위치정보를 전달받아 제공하는 무료 서비스이며, 구체적으로는 이용자의 현재 위치 또는 특정 위치를 기준으로 특정 지역커뮤니티에 가입자격을 부여하고 다른 이용자와 해당 지역과 관련된 게시물을 작성할 수 있도록 하는 서비스(지역커뮤니티서비스), 다른 이용자와 공유하거나 그와 관련된 게시물을 작성할 수 있도록 하는 서비스(장소공유서비스), 이용자의 현재 위치를 사용한 생활 정보나 광고성 정보를 제공하는 서비스(정보제공서비스), 그리고 이용자가 보유하는 사진 등 콘텐츠에 기록되거나 콘텐츠와 결합된 위치정보를 활용하여 이용자의 친구들과 콘텐츠를 공유하도록 도와주는 서비스(콘텐츠공유서비스)가 있습니다. 특히, 이용자가 14세 미만 이용자로서 개인위치정보를 활용한 위치기반 서비스를 이용하기 위해서는 부모님 등 법정대리인의 동의가 먼저 있어야 합니다. 만약 법정대리인의 동의 없이 위치기반서비스가 이용된 것으로 판명된 때에는 {{ companyShort }}는 즉시 이용자의 위치기반서비스 이용을 중단하는 등 적절한 제한을 할 수 있습니다.
            {{ companyShort }}는 이용자의 위치정보를 안전하게 보호하기 위하여 위치정보관리책임자(이름,전화번호, 이메일)를 지정하고 있습니다.
            이 외의 {{ companyShort }}가 제공하는 위치기반 서비스에 관한 상세한 사항은 ‘{{ companyShort }} 위치기반 서비스 이용약관’을 참고하여 주십시오.
        </p>


        <h3>제10조 (서비스 중단)</h3>
        <p>
            {{ companyShort }}는 서비스를 365일, 24시간 쉬지 않고 제공하기 위하여 최선의 노력을 다합니다. 다만, 장비의 유지∙보수를 위한 정기 또는 임시 점검 또는 다른 상당한 이유로 {{ companyShort }} 서비스의 제공이 일시 중단될 수 있으며, 이때에는 미리 서비스 제공화면에 공지합니다. 만약, {{ companyShort }}로서도 예측할 수 없는 이유로 서비스가 중단된 때에는 {{ companyShort }}가 상황을 파악하는 즉시 통지하겠습니다.
        </p>


        <h3>제11조 (이용계약 해지)</h3>
        <p>
            이용자가 {{ companyShort }} 서비스의 이용을 더 이상 원치 않는 때에는 언제든지 {{ companyShort }} 서비스 이용계약의 해지 신청을 할 수 있으며, {{ companyShort }}는 법령이 정하는 바에 따라 신속히 처리합니다.
            이용계약이 해지되면 법령 및 개인정보 처리방침에 따라 이용자의 정보를 보유하는 경우를 제외하고는 이용자의 정보나 이용자가 작성한 게시물 등 모든 데이터는 삭제됩니다. 다만, 이용자가 작성한 게시물이 제3자에 의하여 스크랩 또는 다른 공유 기능으로 게시되거나, 이용자가 제3자의 게시물에 댓글 등 게시물을 추가하는 등의 경우에는 다른 이용자의 정상적 서비스 이용을 위하여 필요한 범위 내에서는 서비스 내에 삭제되지 않고 남아 있게 됩니다.
        </p>


        <h3>제12조 (책임제한)</h3>
        <p>
            {{ companyShort }}는 법령상 허용되는 한도 내에서 {{ companyShort }} 서비스와 관련하여 본 약관에 명시되지 않은 어떠한 구체적인 사항에 대한 약정이나 보증을 하지 않습니다. 예를 들어, {{ companyShort }}는 서비스에 속한 콘텐츠, 서비스의 특정 기능, 서비스의 이용가능성에 대하여 어떠한 약정이나 보증을 하는 것이 아니며, {{ companyShort }} 서비스를 "있는 그대로 " 제공할 뿐입니다.
        </p>


        <h3>제13조 (손해배상)</h3>
        <p>
            {{ companyShort }}의 과실로 인하여 이용자가 손해를 입게 될 경우 {{ companyShort }}는 법령에 따라 이용자의 손해를 배상하겠습니다.
            다만 {{ companyShort }}는 서비스에 접속 또는 이용과정에서 발생하는 개인적인 손해, 제3자가 불법적으로 {{ companyShort }}의 서버에 접속하거나 서버를 이용함으로써 발생하는 손해, 제3자가 {{ companyShort }} 서버에 대한 전송 또는 {{ companyShort }} 서버로부터의 전송을 방해함으로써 발생하는 손해, 제3자가 악성 프로그램을 전송 또는 유포함으로써 발생하는 손해, 전송된 데이터의 생략, 누락, 파괴 등으로 발생한 손해, 명예훼손 등 {{ companyShort }}의 과실 없이 제3자가 {{ companyShort }} 서비스를 이용하는 과정에서 이용자에게 발생시킨 손해에 대하여 책임을 부담하지 않습니다. 또한 {{ companyShort }}는 법률상 허용되는 한도 내에서 간접 손해, 특별 손해, 결과적 손해, 징계적 손해, 및 징벌적 손해에 대한 책임을 부담하지 않습니다.
        </p>


        <h3>제14조 (약관수정)</h3>
        <p>
            {{ companyShort }}는 법률이나 {{ companyShort }} 서비스의 변경사항을 반영하기 위한 목적 등으로 본 약관이나 서비스 Q&A 센터의 서비스 이용방법, 해당 안내 및 고지사항을 수정할 수 있습니다. 본 약관이 변경되는 경우 {{ companyShort }}는 변경 사항을 {{ companyShort }} 서비스 초기화면에 게시하며, 변경된 약관은 게시한 날로부터 7 일 후부터 효력이 발생합니다.
            {{ companyShort }}는 변경된 약관을 게시한 날로부터 효력이 발생되는 날까지 약관변경에 대한 이용자의 의견을 기다립니다. 위 기간이 지나도록 이용자의 의견이 {{ companyShort }}에 접수되지 않으면, 이용자가 변경된 약관에 따라 서비스를 이용하는 데에 동의하는 것으로 간주합니다. {{ companyShort }}로서는 매우 안타까운 일이지만, 이용자가 변경된 약관에 동의하지 않는 경우 변경된 약관의 적용을 받는 해당 서비스의 제공이 더 이상 불가능하게 됩니다.
        </p>


        <h3>제15조 (규정의 준용 및 기타)</h3>
        <p>
            본 약관 또는 {{ companyShort }} 서비스와 관련하여서는 대한민국의 법률이 적용됩니다.
            본 약관은 {{ companyShort }}와 이용자와의 관계에 적용되며, 제3자의 수익권을 발생시키지 않습니다.
            이용자가 본 약관을 준수하지 않은 경우에, {{ companyShort }}가 즉시 조치를 취하지 않더라도 {{ companyShort }}가 가지고 있는 권리를 포기하는 것이 아니며, 본 약관 중 일부 조항의 집행이 불가능하게 되더라도 다른 조항에는 영향을 미치지 않습니다.
        </p>


        <h3>부칙</h3>
        <ul class="terms-list">
            <li>공고일자 : 2018년 6월 1일</li>
            <li>시행일자 : 2018년 6월 1일</li>
        </ul>
    </div>
    <CloseBtn></CloseBtn>
  </div>
</template>

<script>
import {globalVar} from '@/globalVar'
import CloseBtn from '@/components/misc/CloseBtn'

export default {
  name: 'terms',

  data () {
    return {
      companyShort: globalVar.companyShort,
      companyKo: globalVar.companyKo,
      geolocate: globalVar.geolocate,
      privacy: globalVar.privacy,
      terms: globalVar.terms,
      companyCEO: globalVar.companyCEO,
      callTo: globalVar.callTo,
      mailTo: globalVar.mailTo,
    }
  },

  metaInfo: {
    title: globalVar.serviceKo + ', ' + globalVar.serviceEn,
    titleTemplate: '%s - 이용약관',
  },

  components: {
    CloseBtn
  },

  updated () {
    window.postMessage(document.title)
    console.log(document.title)
  },

}
</script>

<style lang="scss">

</style>
