<template>
  <div id="terms">
    <div class="terms-wrapper">
        <h1>{{ companyShort }} {{ privacy }}</h1>
        <p>{{ companyKo }}(이하 '{{ companyShort }}'라 합니다)는 이용자의 개인정보를 매우 소중히 생각합니다. {{ companyShort }}는 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 개인정보보호법을 비롯한 개인정보 관련 법령을 준수하며, 이용자의 개인정보 보호 및 권익을 보호하고 개인정보와 관련한 이용자의 고충을 원활하게 처리할 수 있도록 다음과 같은 처리방침을 두고 있습니다.
        </p>


        <h3>제1조 (개인정보의 처리 목적)</h3>
        <p>{{ companyShort }}는 개인정보를 다음의 목적을 위해 처리합니다.
        </p>
            <ol class="terms-list">
                <li>서비스 회원가입 및 관리
                    <ul>
                        <li>회원 가입의사 확인, 회원자격 유지·관리, 서비스 문의 해결, 서비스 부정이용 방지, 각종 고지·통지, 접속빈도 파악 또는 회원의 서비스 이용에 대한 통계 등을 목적으로 개인정보를 처리합니다.</li>
                    </ul>
                </li>
                <li>재화 또는 서비스 제공
                    <ul>
                        <li>서비스 제공, 콘텐츠 제공, 맞춤이나 특화 서비스 제공, 요금결제·정산 등을 목적으로 개인정보를 처리합니다.</li>
                    </ul>
                </li>
                <li>마케팅 및 광고에의 활용
                    <ul>
                        <li>신규 서비스 개발 및 맞춤 서비스 제공, 이벤트 및 광고성 정보 제공, 인구통계학적 특성에 따른 서비스 제공 등을 목적으로 개인정보를 처리합니다.</li>
                    </ul>
                </li>
            </ol>


        <h3>제2조 (수집하는 개인정보의 항목 및 수집방법)</h3>
            <ol class="terms-list">
                <li>수집하는 개인정보 항목
                <br>휴대전화번호, SNS 계정정보(소셜 로그인), 닉네임, 자택주소, 비밀번호, 성별, 사진, 위치정보, 단말기 정보, 서비스 이용 기록, 접속 로그, 쿠키, 접속 IP 정보, 결제관련 정보(유료 서비스 이용 시)
                </li>
                <li>수집방법
                    <ol>
                        <li>회원가입 및 서비스 이용 과정에서 이용자가 직접 정보를 입력하는 경우</li>
                        <li>회원가입 및 서비스 이용 과정에서 자동으로 생성 되어 수집 되는 경우
                          <br>모바일 웹/앱, PC웹 이용 과정에서 단말기정보(OS, 화면사이즈, 디바이스 아이디), IP주소, 쿠키, 방문일시 등의 정보
                        </li>
                        <li>고객센터를 통한 상담 과정 수집되는 경우</li>
                        <li>제휴 서비스 또는 단체 등으로부터 제공받거나 온·오프라인에서 진행되는 이벤트/행사 등 참여하며 제공하는 경우</li>
                    </ol>
                </li>
            </ol>


        <h3>제3조 (개인정보의 처리 및 보유 기간)</h3>
            <ol class="terms-list">
                <li>{{ companyShort }}는 법령에 따른 개인정보 보유·이용기간 또는 정보주체로부터 개인정보를 수집 시에 동의 받은 개인정보 보유, 이용기간 내에서 개인정보를 처리 및 보유합니다.</li>
                <li>각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.
                    <ol>
                        <li>회사 내부 방침에 의한 정보보유 사유
                            <ul>
                                <li>
                                    보존 항목: 부정 이용 기록<br>
                                    보존 이유: 부정 이용 방지<br>
                                    보존 기간: 10년
                                </li>
                                <li>보존 항목: 판매 게시물 및 대화 내용<br>
                                    보존 이유: 거래 관련 사기 방지 및 분쟁 해결<br>
                                    보존 기간: 5년
                                </li>
                            </ul>
                        </li>
                        <li>관련 법령에 의한 정보보유 사유
                            <ul>
                                <li>
                                    보존 항목: 계약 또는 청약철회 등에 관한 기록<br>
                                    보존 이유: 전자상거래 등에서의 소비자보호에 관한 법률<br>
                                    보존 기간: 5년
                                </li>
                                <li>
                                    보존 항목: 대금결제 및 재화 등의 공급에 관한 기록<br>
                                    보존 이유: 전자상거래 등에서의 소비자보호에 관한 법률<br>
                                    보존 기간: 5년
                                </li>
                                <li>
                                    보존 항목: 소비자의 불만 또는 분쟁처리에 관한 기록<br>
                                    보존 이유: 전자상거래 등에서의 소비자보호에 관한 법률<br>
                                    보존 기간: 3년
                                </li>
                                <li>
                                    보존 항목: 표시/광고에 관한 기록<br>
                                    보존 이유: 전자상거래 등에서의 소비자보호에 관한 법률<br>
                                    보존 기간: 6개월
                                </li>
                                <li>
                                    보존 항목: 세법이 규정하는 모든 거래에 관한 장부 및 증빙서류<br>
                                    보존 이유: 국세기본법<br>
                                    보존 기간: 5년
                                </li>
                                <li>
                                    보존 항목: 전자금융 거래에 관한 기록<br>
                                    보존 이유: 전자금융거래법<br>
                                    보존 기간: 5년
                                </li>
                            </ul>
                        </li>
                    </ol>
                </li>
            </ol>


        <h3>제4조 (개인정보의 제3자 제공에 관한 사항)</h3>
        <p>
            {{ companyShort }}는 정보주체의 동의, 법률의 특별한 규정 등 개인정보 보호법 제17조 및 제18조에 해당하는 경우를 제외하고는 사용자 개인정보를 위에서 명시한 목적 범위를 초과하여 이용하거나 제3자에게 제공 또는 공유하지 않습니다.
        </p>


        <h3>제5조 (정보주체와 법정대리인의 권리·의무 및 그 행사방법)</h3>
        <p>
            이용자는 개인정보주체로써 다음과 같은 권리를 행사할 수 있습니다.
        </p>
            <ol class="terms-list">
                <li>정보주체는 {{ companyShort }}에 대해 언제든지 개인정보 열람, 정정, 삭제, 처리정지 요구 등의 권리를 행사할 수 있습니다.</li>
                <li>제1항에 따른 권리 행사는 {{ companyShort }}에 대해 개인정보 보호법 시행령 제41조 제1항에 따라 서면, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 {{ companyShort }}는 이에 대해 지체 없이 조치하겠습니다.</li>
                <li>제1항에 따른 권리 행사는 정보주체의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우 개인정보 보호법 시행규칙 별지 제11호 서식에 따른 위임장을 제출하셔야 합니다.</li>
                <li>개인정보 열람 및 처리정지 요구는 개인정보보호법 제35조 제5항, 제37조 제2항에 의하여 정보주체의 권리가 제한 될 수 있습니다.</li>
                <li>개인정보의 정정 및 삭제 요구는 다른 법령에서 그 개인정보가 수집 대상으로 명시되어 있는 경우에는 그 삭제를 요구할 수 없습니다.</li>
                <li>{{ companyShort }}는 정보주체 권리에 따른 열람의 요구, 정정·삭제의 요구, 처리정지의 요구 시 열람 등 요구를 한 자가 본인이거나 정당한 대리인인지를 확인합니다.</li>
            </ol>


        <h3>제6조 (개인정보의 파기)</h3>
        <p>
            {{ companyShort }}는 원칙적으로 개인정보 처리목적이 달성된 경우에는 회사 내부 방침 또는 관계 법령에서 정한 일정한 기간 동안 보관한 다음 지체 없이 파기합니다. 종이에 출력된 개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기하고, 전자적 파일 형태로 저장된 개인정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.
        </p>


        <h3>제7조 (개인정보 관리책임자)</h3>
            <ol class="terms-list">
                <li>{{ companyShort }}는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보 처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와 같이 개인정보 보호책임자를 지정하고 있습니다.</li>
                    <ul>
                        <li>
                            개인정보 관리책임자<br>
                            성명: 김철수<br>
                            직책: 개인정보 보안담당<br>
                            직급: <br>
                            연락처 : 010-0000-0000, privacy@tite.com<br>
                            ※ 개인정보 보호 담당부서로 연결됩니다.
                        </li>
                    </ul>
                <li>정보주체는 {{ companyShort }}의 서비스를 이용하시면서 발생한 모든 개인정보 보호 관련 문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및 담당부서로 문의하실 수 있습니다. {{ companyShort }}는 정보주체의 문의에 대해 지체 없이 답변 및 처리해드릴 것입니다.</li>
            </ol>


        <h3>제8조 (개인정보의 안전성 확보 조치)</h3>
        <p>
            {{ companyShort }}는 개인정보보호법 제29조에 따라 다음과 같이 안전성 확보에 필요한 기술적/관리적 및 물리적 조치를 하고 있습니다.
        </p>
            <ol class="terms-list">
                <li>정기적인 자체 감사 실시</li>
                <li>개인정보 취급 직원의 최소화 및 교육</li>
                <li>내부관리계획의 수립 및 시행</li>
                <li>해킹 등에 대비한 기술적 대책</li>
                <li>개인정보의 암호화</li>
                <li>접속기록의 보관 및 위변조 방지</li>
                <li>개인정보에 대한 접근 제한</li>
                <li>문서보안을 위한 잠금장치 사용</li>
                <li>비인가자에 대한 출입 통제</li>
            </ol>


        <h3>제9조 (개인정보 처리방침 변경)</h3>
            <ol class="terms-list">
                <li>{{ companyShort }}는 법률이나 서비스의 변경사항을 반영하기 위한 목적 등으로 개인정보 취급방침을 수정할 수 있습니다.</li>
                <li>이 개인정보처리방침은 시행일로부터 적용되며, 법령 및 방침에 따른 변경내용의 추가, 삭제 및 정정이 있는 경우에는 변경사항의 시행 7일 전부터 공지사항을 통하여 고지할 것입니다.</li>
            </ol>


        <h3>부칙</h3>
        <ul class="terms-list">
            <li>공고일자 : 2018년 6월 1일</li>
            <li>시행일자 : 2018년 6월 1일</li>
        </ul>
    </div>
    <CloseBtn></CloseBtn>
  </div>
</template>

<script>
import {globalVar} from '@/globalVar'
import CloseBtn from '@/components/misc/CloseBtn'

export default {
  name: 'privacy',

  data () {
    return {
      companyShort: globalVar.companyShort,
      companyKo: globalVar.companyKo,
      geolocate: globalVar.geolocate,
      privacy: globalVar.privacy,
      terms: globalVar.terms,
    }
  },

  components: {
    CloseBtn
  }
}
</script>

<style lang="scss">

</style>
